In [2]:
import pandas as pd

In [3]:
# create table with index as time series: 15:00, 15:03, 15:08, 15:13, 15:15:15, 15:20, 15:25, 15:32 and values as 1, 2, 3, 4, 5, 6, 7, 8
df = pd.DataFrame({'time': ['15:00', '15:03', '15:08', '15:13', '15:15', '15:20', '15:25', '15:32'], 'value': [1, 2, 3, 4, 5, 6, 7, 8]})
df['time'] = pd.to_datetime(df['time'], format='%H:%M')
df = df.set_index('time')
df

                     value
time
1900-01-01 15:00:00      1
1900-01-01 15:03:00      2
1900-01-01 15:08:00      3
1900-01-01 15:13:00      4
1900-01-01 15:15:00      5
1900-01-01 15:20:00      6
1900-01-01 15:25:00      7
1900-01-01 15:32:00      8

In [4]:
df.index[0]

Timestamp('1900-01-01 15:00:00')

In [23]:
ind_new = pd.date_range(start=df.index.min(), end=df.index.max(), freq='5min')
ind_union = ind_new.union(df.index)
df_new = df.reindex(ind_union)
df_new

                     value
1900-01-01 15:00:00    1.0
1900-01-01 15:03:00    2.0
1900-01-01 15:05:00    NaN
1900-01-01 15:08:00    3.0
1900-01-01 15:10:00    NaN
1900-01-01 15:13:00    4.0
1900-01-01 15:15:00    5.0
1900-01-01 15:20:00    6.0
1900-01-01 15:25:00    7.0
1900-01-01 15:30:00    NaN
1900-01-01 15:32:00    8.0

In [24]:
df_new= df_new.interpolate(method='index')
df_new

                        value
1900-01-01 15:00:00  1.000000
1900-01-01 15:03:00  2.000000
1900-01-01 15:05:00  2.400000
1900-01-01 15:08:00  3.000000
1900-01-01 15:10:00  3.400000
1900-01-01 15:13:00  4.000000
1900-01-01 15:15:00  5.000000
1900-01-01 15:20:00  6.000000
1900-01-01 15:25:00  7.000000
1900-01-01 15:30:00  7.714286
1900-01-01 15:32:00  8.000000

In [25]:
df_new.reindex(ind_new)

                        value
1900-01-01 15:00:00  1.000000
1900-01-01 15:05:00  2.400000
1900-01-01 15:10:00  3.400000
1900-01-01 15:15:00  5.000000
1900-01-01 15:20:00  6.000000
1900-01-01 15:25:00  7.000000
1900-01-01 15:30:00  7.714286